use E:\论文学习\写的论文\出口持续时间与技术复杂度\数据\年份加总\1998数据加总后.dta,clear
 append using E:\论文学习\写的论文\出口持续时间与技术复杂度\数据\年份加总\1999数据加总后.dta
  append using E:\论文学习\写的论文\出口持续时间与技术复杂度\数据\年份加总\2000数据加总后.dta
 append using E:\论文学习\写的论文\出口持续时间与技术复杂度\数据\年份加总\2001数据加总后.dta
 append using E:\论文学习\写的论文\出口持续时间与技术复杂度\数据\年份加总\2002数据加总后.dta
 append using E:\论文学习\写的论文\出口持续时间与技术复杂度\数据\年份加总\2003数据加总后.dta
 append using E:\论文学习\写的论文\出口持续时间与技术复杂度\数据\年份加总\2004数据加总后.dta
 append using E:\论文学习\写的论文\出口持续时间与技术复杂度\数据\年份加总\2005数据加总后.dta
 append using E:\论文学习\写的论文\出口持续时间与技术复杂度\数据\年份加总\2006数据加总后.dta
 append using E:\论文学习\写的论文\出口持续时间与技术复杂度\数据\年份加总\2007数据加总后.dta
 append using E:\论文学习\写的论文\出口持续时间与技术复杂度\数据\年份加总\2008数据加总后.dta
 append using E:\论文学习\写的论文\出口持续时间与技术复杂度\数据\年份加总\2009数据加总后.dta
 append using E:\论文学习\写的论文\出口持续时间与技术复杂度\数据\年份加总\2010数据加总后.dta
 append using E:\论文学习\写的论文\出口持续时间与技术复杂度\数据\年份加总\2011数据加总后.dta
save E:\论文学习\写的论文\出口持续时间与技术复杂度\数据\年份加总\1998-2011.dta
